target/test-classes/xml/ocs/TC4993_upgrade_ocs_order_device_peripheral.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header/>
    <soapenv:Body>
        <ord1:createOrder type="UPGRADE" provisioningSystem="OCS" correlationId="" xsi:schemaLocation="http://order.telco.hsntech.com ShopFront.xsd" xmlns:ord1="http://order.telco.hsntech.com" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <account type="RESIDENTIAL" accountNumber="$accountNumber$"/>
            <verification runCreditCheck="false" termsAndConditionsAccepted="true" refundableDepositAccepted="false" acceptAgreement="true">
                <interconnect>
                    <param name="PAYASYOUGO"/>
                </interconnect>
            </verification>
            <orderDetail orderRef="12345" ipAddress="160.206.234.22" salesChannel="Onlines" externalSystemID="COCO" devicePrint="DEVICEPRINT-AA" paymentMethod="CARD">
                <dateTime>2011-06-10T16:44:31.0Z</dateTime>
                <orderItem id="1" dealSKU="DEAL-INHAND">
                    <serviceRef reference="Upgrade Mobile">$MPN$</serviceRef>
                    <tariff productCode="FC36-700-500-5MA">
                        <deliveryMethod>INHAND</deliveryMethod>
                    </tariff>
                    <device productCode="AP725SV-24-2950-180">
                        <deliveryMethod>DELIVER</deliveryMethod>
                        <imei>294902255729057</imei>
                        <serialNumber>123152436457568486784684</serialNumber>
                        <agreement provider="AGRTESCOMOBILE"/>
                    </device>
                    <peripheral productCode="LIW108IBK-00-0000-96">
                        <deliveryMethod>DELIVER</deliveryMethod>
                        <agreement provider="AGRTESCOMOBILE"/>
                    </peripheral>
                    <discBundle productCode="00750-SB-B" bundleGroup="SB-GRP-B" billCapNotifications="false">
                        <deliveryMethod>INHAND</deliveryMethod>
                    </discBundle>
                    <insurance productCode="MA">
                        <deliveryMethod>INHAND</deliveryMethod>
                    </insurance>
                </orderItem>
                <paymentRequest>
                    <cardName>Card</cardName>
                    <cardNumber>5105105105105100</cardNumber>
                    <cardType>MC</cardType>
                    <cardExpiryDate>0328</cardExpiryDate>
                    <cvv>111</cvv>
                </paymentRequest>
            </orderDetail>
        </ord1:createOrder>
    </soapenv:Body>
</soapenv:Envelope>
